package ru.PageObjects.Admin;

import Helpers.Dictionary;
import org.junit.Assert;
import org.openqa.selenium.WebDriver;

import static com.codeborne.selenide.Condition.visible;
import static com.codeborne.selenide.Selenide.$;
import static com.codeborne.selenide.Selenide.$$;

/**
 * Класс для работы со страницей [Список пользователей]
 * (Справочники / Реестр заказчиков / Полное наименование / Сотрудники организации - перейти к списку).
 * ( .kontur.ru/supplier/lk/Dictionaries/EmployeeList.aspx )
 * Updated by Kirill G. Rydzyvylo on 12.08.2020.
 * Updated by Vladimir V. Klochkov on 09.03.2021.
 */
public class EmployeeListPage extends CommonAdminPage {
    /*******************************************************************************************************************
     * Локаторы элементов страницы.
     ******************************************************************************************************************/
    // region Заголовок страницы [Список пользователей]

    //------------------------------------------------------------------------------------------------------------------
    //------------------------------------------------------------------------------------------------------------------

    // endregion

    // region Раздел [Пользователей]

    //------------------------------------------------------------------------------------------------------------------
    //------------------------------------------------------------------------------------------------------------------

    // endregion

    // region Таблица [Список пользователей]

    //------------------------------------------------------------------------------------------------------------------
    // Все строки в таблице [Список пользователей]
    private static final String ROWS_IN_EMPLOYEES_TABLE_XPATH =
            "//table[@id='BaseMainContent_MainContent_jqgEmployees']//tr[contains(@class,'jqgrow')]";
    //------------------------------------------------------------------------------------------------------------------
    // Столбец [ФИО]
    private static final String FIO_XPATH = "//table[@id='BaseMainContent_MainContent_jqgEmployees']//td[@title='%s']/a";
    //------------------------------------------------------------------------------------------------------------------

    // endregion

    // region Блок управляющих нопок внизу страницы

    //------------------------------------------------------------------------------------------------------------------
    // Кнопка [Добавить пользователя]
    private static final String CREATE_EMPLOYEE_REQUEST_ID = "BaseMainContent_MainContent_hlCreateEmployeeRequest";
    //------------------------------------------------------------------------------------------------------------------

    // endregion

    /*******************************************************************************************************************
     * Поля класса.
     ******************************************************************************************************************/
    private final Dictionary buttonNames = new Dictionary(); // все кнопки на странице

    /*******************************************************************************************************************
     * Конструктор класса. Отвечает за инициализацию всех полей класса.
     * @param driver экземпляр WebDriver
     ******************************************************************************************************************/
    public EmployeeListPage(WebDriver driver) {
        super(driver);
        //--------------------------------------------------------------------------------------------------------------
        buttonNames.add("Добавить пользователя", CREATE_EMPLOYEE_REQUEST_ID);
        //--------------------------------------------------------------------------------------------------------------
    }

    /*******************************************************************************************************************
     * Методы страницы.
     ******************************************************************************************************************/
    /**
     * Делает щелчок по ссылке с указанным текстом в столбце [ФИО].
     *
     * @param fio имя пользователя, которое требуется выбрать
     */
    public void clickOnFIOLinkByText(String fio) throws Exception {
        String link = String.format(FIO_XPATH, fio);
        System.out.printf("[ИНФОРМАЦИЯ]: делаем нажатие на элемент [%s].%n", link);
        $(this.getBy(link)).waitUntil(visible, timeout, polling).click();
        this.waitForPageLoad();
        this.checkPageUrl("Информация о пользователе - Администратор");
    }

    /**
     * Проверяет количество записей в таблице [Список пользователей].
     *
     * @param expectedRows ожидаемое количество записей в таблице [Список пользователей]
     */
    public void checkNumberOfRowsInEmployeeTable(int expectedRows) {
        int actualRows = $$(this.getBy(ROWS_IN_EMPLOYEES_TABLE_XPATH)).size();
        Assert.assertEquals("[ОШИБКА]: количество записей в таблице [Список пользователей] неверно",
                expectedRows, actualRows);
    }

    /**
     * Нажимает на указанную кнопку
     *
     * @param buttonName имя кнопки
     */
    public void clickOnButtonByName(String buttonName) throws Exception {
        System.out.printf(
                "[ИНФОРМАЦИЯ]: произведено нажатие кнопки [%s] на странице [Запросы сотрудников].%n", buttonName);
        $(this.getBy(buttonNames.find(buttonName))).waitUntil(clickable, timeout, polling).click();
        this.waitLoadingImage();
    }
}
