package ru.PageObjects.Admin;

import Helpers.Dictionary;
import org.openqa.selenium.WebDriver;

import java.util.concurrent.TimeUnit;

/**
 * Класс для работы со страницей [Информация о пользователе "X"]
 * (Справочники / Реестр заказчиков / Полное наименование / Сотрудники организации - перейти к списку / выбрать сотрудника).
 * ( .kontur.ru/supplier/lk/Dictionaries/EmployeeView.aspx )
 * Updated by Kirill G. Rydzyvylo on 12.08.2020.
 * Updated by Kirill G. Rydzyvylo on 12.08.2020.
 */
public class EmployeeViewPage extends CommonAdminPage {
    /*******************************************************************************************************************
     * Локаторы элементов страницы.
     ******************************************************************************************************************/
    // region Раздел [Информацтя о пользоветеле "X"]

    //------------------------------------------------------------------------------------------------------------------
    //------------------------------------------------------------------------------------------------------------------

    // endregion

    // region Таблица [Сертификаты]

    //------------------------------------------------------------------------------------------------------------------
    //------------------------------------------------------------------------------------------------------------------

    // endregion

    // region Таблица [Прикрепленные документы]

    //------------------------------------------------------------------------------------------------------------------
    //------------------------------------------------------------------------------------------------------------------

    // endregion

    // region Блок управляющих кнопок внизу страницы

    //------------------------------------------------------------------------------------------------------------------
    //Кнопка [Редактировать]
    private static final String EMPLOYEE_EDIT = "BaseMainContent_MainContent_hlEmployeeEdit";
    //------------------------------------------------------------------------------------------------------------------

    // endregion

    /*******************************************************************************************************************
     * Поля класса.
     ******************************************************************************************************************/
    private final Dictionary buttonNames = new Dictionary(); // все кнопки на странице

    /*******************************************************************************************************************
     * Конструктор класса. Отвечает за инициализацию всех полей класса.
     * @param driver экземпляр WebDriver
     ******************************************************************************************************************/
    public EmployeeViewPage(WebDriver driver) {
        super(driver);
        //--------------------------------------------------------------------------------------------------------------
        buttonNames.add("Редактировать", EMPLOYEE_EDIT);
        //--------------------------------------------------------------------------------------------------------------
    }

    /*******************************************************************************************************************
     * Методы страницы.
     ******************************************************************************************************************/
    /**
     * Делает щелчок мышью по указанной кнопке.
     *
     * @param buttonName имя кнопки
     */
    public void clickOnButton(String buttonName) throws Exception {
        this.logButtonNameToPress(buttonName);
        this.clickInElementJS(this.getBy(buttonNames.find(buttonName)));
        this.logPressedButtonName(buttonName);
        TimeUnit.SECONDS.sleep(3);
    }
}
