@smoke @runTest @check_the_customer_menu_items
Feature: User Checks The Customer Menu Items
  #=====================================================================================================================
  # Проверка разделов меню в личном кабинете Заказчика
  # В системе созданы следующие пользователи:
  # Заказчик - "Заказчик для боевого сервера"
  #=====================================================================================================================
  Scenario: Проверка разделов меню в личном кабинете Заказчика
    Given Параметру 'Тип теста' установлено значение "Check The Customer Menu Items"
    And Все требуемые для теста сертификаты присутствуют на компьютере
    #*******************************************************************************************************************
    #
    #                 Заказчик проверяет страницу "Настройки договоров и доп. соглашений" в разделе "ОБЩИЕ НАСТРОЙКИ"
    #
    #*******************************************************************************************************************
    When "Заказчик для боевого сервера" заходит в личный кабинет
    And 'Заказчик' переходит на страницу "МОЯ ОРГАНИЗАЦИЯ/ОБЩИЕ НАСТРОЙКИ"
    And 'Заказчик' открывает "Раздел Настройки договоров и доп. соглашений" на странице 'Общие настройки'
    #*******************************************************************************************************************
    #
    #                 Заказчик проверяет страницу создания извещения о проведении коммерческого аукциона
    #
    #*******************************************************************************************************************
    And 'Заказчик' переходит на страницу 'Мои закупки'
    And 'Заказчик А' открывает страницу создания извещения для коммерческой закупки "Аукцион"
    And 'Заказчик А' заполняет сведения о процедуре: "Коммерческая закупка - Аукцион"
    #*******************************************************************************************************************
    #
    #                 Заказчик проверяет страницу "Мои договоры"
    #
    #*******************************************************************************************************************
    And 'Заказчик' переходит на страницу "ДОГОВОРЫ/ДОГОВОРЫ" с именем URL для проверки "Мои контракты"
    #*******************************************************************************************************************
    #
    #                 Заказчик проверяет страницу "Настройки интеграции с ЕИС"
    #
    #*******************************************************************************************************************
    And 'Заказчик' переходит на страницу "МОЯ ОРГАНИЗАЦИЯ/НАСТРОЙКИ ИНТЕГРАЦИИ С ЕИС" с именем URL для проверки "Настройки интеграции с ЕИС"
    #*******************************************************************************************************************
    #
    #                 Заказчик проверяет страницу "Планы закупок"
    #
    #*******************************************************************************************************************
    And 'Заказчик' переходит на страницу "ПЛАНЫ ЗАКУПОК" с именем URL для проверки "Планы закупок"
    #*******************************************************************************************************************
    #
    #                 Заказчик проверяет страницу "Реестр отчетов"
    #
    #*******************************************************************************************************************
    And 'Заказчик' переходит на страницу "ОТЧЕТЫ" с именем URL для проверки "Реестр отчетов"
    And 'Пользователь' покидает систему
