package ru.PageObjects.CommonDialogs;

import org.openqa.selenium.WebDriver;
import ru.PageObjects.CommonPage;

import static com.codeborne.selenide.Condition.disappear;
import static com.codeborne.selenide.Selenide.$;

/**
 * Класс для работы с диалоговым окном [Сохранено].
 * Created by Kirill G. Rydzyvylo on 13.02.2020.
 * Updated by Vladimir V. Klochkov on 13.02.2020.
 */
public class SavedAngularDialog extends CommonPage {
    /*******************************************************************************************************************
     * Локаторы элементов страницы.
     *******************************************************************************************************************/
    //------------------------------------------------------------------------------------------------------------------
    // Заголовок диалогового окна [Сохранено]
    private static final String SAVED_DIALOG_WINDOW_TITLE_ID =
            "//kendo-dialog-titlebar//div[contains(text(),'Сохранено')]";
    //------------------------------------------------------------------------------------------------------------------
    // Кнопка [Продолжить]
    private static final String CONTINUE_BUTTON_ID = "goToEditCard";
    //------------------------------------------------------------------------------------------------------------------
    /*******************************************************************************************************************
     * Поля класса.
     ******************************************************************************************************************/


    /*******************************************************************************************************************
     * Конструктор класса. Отвечает за инициализацию всех полей класса.
     * @param driver экземпляр WebDriver
     ******************************************************************************************************************/
    public SavedAngularDialog(WebDriver driver) {
        super(driver);
    }

    /*******************************************************************************************************************
     * Методы страницы.
     ******************************************************************************************************************/
    /**
     * Нажимает кнопку [Продолжить].
     */
    public void clickOnContinueButton() throws Exception {
        $(this.getBy(SAVED_DIALOG_WINDOW_TITLE_ID)).waitUntil(clickable, timeout, polling);
        this.logButtonNameToPress("Продолжить");
        this.clickInElementJS(this.getBy(CONTINUE_BUTTON_ID));
        this.logPressedButtonName("Продолжить");
        this.waitForPageLoad();
        this.setShortDrivWait(); //|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
        $(this.getBy(SAVED_DIALOG_WINDOW_TITLE_ID)).shouldBe(disappear);
        this.setDefltDrivWait(); //|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
    }
}
